<template>
  <div class="terms">
    <div class="mx-auto max-w-5xl p-10 text-center">
      <h1 class="pb-5 text-3xl font-bold">Политика конфиденциальности</h1>

      <div>
        <p class="mb-3">
          LLP "ZHASKREATIV" (далее - «Компания», «мы», «нас», «наш») уважает вашу конфиденциальность и обязуется
          защищать личную информацию, которую вы предоставляете нам через наш сайт kuryltai.kz (далее - «Сайт»). Эта
          Политика конфиденциальности (далее - «Политика») описывает, какие данные мы собираем, как мы их используем и
          как мы защищаем вашу информацию.
        </p>

        <h2>1. Собираемая информация</h2>
        <p>
          Мы собираем несколько типов информации для различных целей, чтобы предоставить и улучшить наш Сайт и услуги.
        </p>
        <ol class="text-left">
          <li>
            <h3>1.1 Информация, предоставленная пользователями</h3>
            <p>
              Регистрационные данные: При регистрации на Сайте мы можем собирать вашу фамилию, имя, адрес электронной
              почты, номер телефона и другие данные, необходимые для создания учетной записи.
            </p>
            <p>
              Данные социальных сетей: Если вы входите через социальные сети (например, Facebook, Google), мы можем
              получить вашу информацию от этих сервисов, включая ваше имя пользователя и адрес электронной почты.
            </p>
          </li>
          <li>
            <h3>1.2 Информация, собираемая автоматически</h3>
            <p>
              Файлы cookie и аналогичные технологии: Мы используем файлы cookie для отслеживания активности на нашем
              Сайте и хранения определенной информации. Вы можете настроить свой браузер так, чтобы он отклонял все
              файлы cookie или указывал, когда файл cookie отправляется. Однако, если вы не принимаете файлы cookie, вы
              можете не иметь возможности использовать некоторые части нашего Сайта.
            </p>
            <p>
              Информация об устройстве: Мы можем собирать информацию о вашем устройстве, включая IP-адрес, тип браузера,
              версию браузера, страницы нашего Сайта, которые вы посещаете, время и дату вашего визита, время,
              проведенное на этих страницах, уникальные идентификаторы устройств и другие диагностические данные.
            </p>
          </li>
        </ol>

        <h2>2. Использование данных</h2>
        <p>Мы используем собранные данные для различных целей:</p>
        <ul class="text-left">
          <li>Предоставление и поддержка наших услуг.</li>
          <li>Информирование вас о изменениях в наших услугах.</li>
          <li>Обеспечение взаимодействия с пользователями и клиентской поддержки.</li>
          <li>Предоставление анализа или ценной информации, чтобы мы могли улучшить наш Сайт.</li>
          <li>Мониторинг использования нашего Сайта.</li>
          <li>Выявление, предотвращение и устранение технических проблем.</li>
        </ul>

        <h2>3. Передача данных</h2>
        <p>
          Ваша информация, включая личные данные, может быть передана и храниться на серверах, расположенных за
          пределами вашей страны или других государственных юрисдикций, где законы о защите данных могут отличаться от
          законов вашей юрисдикции.
        </p>

        <h2>4. Защита данных</h2>
        <p>
          Мы принимаем меры безопасности для защиты вашей личной информации от несанкционированного доступа, изменения,
          раскрытия или уничтожения. Однако ни один метод передачи данных через интернет или метод электронного хранения
          не является на 100% безопасным, и мы не можем гарантировать абсолютную безопасность.
        </p>

        <h2>5. Права пользователей</h2>
        <p>Вы имеете следующие права в отношении вашей персональной информации:</p>
        <ul class="text-left">
          <li>Право на доступ к вашей персональной информации.</li>
          <li>Право на исправление вашей персональной информации.</li>
          <li>Право на удаление вашей персональной информации.</li>
          <li>Право ограничивать использование вашей персональной информации.</li>
          <li>Право возражать против обработки вашей персональной информации.</li>
          <li>Право на переносимость данных.</li>
        </ul>

        <h2>6. Изменения в Политике конфиденциальности</h2>
        <p>
          Мы можем обновлять нашу Политику конфиденциальности время от времени. Мы уведомим вас о любых изменениях,
          разместив новую Политику конфиденциальности на этой странице. Рекомендуем периодически просматривать эту
          страницу для получения самой актуальной информации о нашей Политике конфиденциальности.
        </p>

        <h2>7. Контакты</h2>
        <p>Если у вас есть вопросы по поводу этой Политики конфиденциальности, пожалуйста, свяжитесь с нами:</p>
        <p>
          Наименование компании: LLP "ZHASKREATIV"
          <br />
          Адрес: Западно-Казахстанская область, Уральск Г.А., Г.Уральск, Микрорайон 4, Дом 2, КВ. 10
          <br />
          Электронная почта: <a href="mailto:team@kuryltai.kz">team@kuryltai.kz</a>
        </p>
        <p>Эта Политика конфиденциальности вступает в силу с [дата].</p>
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup></script>

<style scoped>
h2 {
  @apply mb-1 text-2xl font-bold;
}

ol,
ul {
  @apply list-inside;
}

a {
  @apply text-blue-500;
}

li {
  @apply ml-5 pl-2;
}
</style>
