<template>
  <div class="terms">
    <div class="max-w-5xl p-10">
      <h1 class="pb-5 text-3xl font-bold">Политика конфиденциальности</h1>

      <div>
        <p class="mb-3">
          Настоящий договор адресован индивидуальным предпринимателям и физическим лицам, зарегистрированным и/или
          авторизованным в приложении Chocodelivery (далее «Курьер»). Онлайн-сервис предоставляется Частной компанией
          «Raketa Soft Ltd.» (далее – Компания). Курьер и Компания заключили настоящий договор (далее – Договор), о
          нижеследующем:
        </p>

        <h2>Термины и определения:</h2>
        <p>
          Политика Конфиденциальности – настоящее предложение использования онлайн-сервиса, публикуемое Компания на
          Сайте и/или в мобильном приложении Компании (далее «Приложение»), обращенное Курьерам.
          Приложение-Chocodelivery
        </p>

        <h2>Основные положения:</h2>
        <ol>
          <li>
            Текст Договора является политикой конфиденциальности (в соответствии с пунктом 5 статьи 395 Гражданского
            кодекса Республики Казахстан политика конфиденциальности – это содержащее все существенные условия договора
            предложение, из которого усматривается воля лица, делающего предложение, заключить договор на указанных в
            предложении условиях с любым, кто отзовется на это предложение). Акцепт оферты – использование
            онлайн-сервиса (в соответствии со статьёй 396 Гражданского кодекса Республики Казахстан). Акцепт – это ответ
            лица, которому адресована оферта, о ее принятии. Акцепт должен быть полным и безоговорочным. Совершая
            действия по акцепту данной политики конфиденциальности, Курьер подтверждает свою правоспособность и
            дееспособность, а также свое законное право вступать в договорные отношения с Компанией. Полным и
            безоговорочным согласием заключить Договор (далее – Акцептом) является выраженное согласие с его условиями
            путем использования онлайн-сервиса Компания.
          </li>
          <li>
            Акцепт Договора означает, что Курьер согласен со всеми положениями настоящего предложения, и равносилен
            заключению Договора и всех приложений к нему. В связи с вышеизложенным, внимательно прочитайте текст
            Договора. Если Вы не согласны с каким-либо пунктом настоящего Договора, Компания предлагает Вам отказаться
            от Акцепта оферты.
          </li>
        </ol>

        <h2>Регистрация на сайте, конфиденциальность и защита персональной информации:</h2>
        <ol start="3">
          <li>
            В соответствии с законодательством Республики Казахстан в сфере защиты персональных данных Компания вправе
            осуществлять сбор, обработку, хранение, использование, (предоставление доступа) и уничтожение (все вместе
            далее по тексту «Обработка») информации Курьера, в том числе: фамилии, имени, номера телефона, данные о
            местонахождении (геолокация), и другой информации (далее по тексту «Персональные данные»), которая
            становится доступна Компания в любой момент времени, в период действия договорных отношений Компания и
            Курьера.
          </li>
          <li>
            Компания обязуется не передавать персональные данные Курьера третьим лицам, за исключением государственных
            органов, уполномоченных запрашивать Персональные данные в соответствии с законодательством Республики
            Казахстан по соответствующему запросу. Персональные данные передаются по защищенному протоколу и Компания
            берет на себя ответственность за обеспечение безопасности персональных данных.
          </li>
          <li>
            Компания обязуется обеспечивать соблюдение требований действующего законодательства Республики Казахстан в
            сфере защиты персональных данных при Обработке Персональных данных Курьера. Компания обязуется предпринимать
            всевозможные правовые, технические и организационные меры, направленные на защиту Персональных данных
            Курьера от неправомерных или случайных действий в отношении таких Персональных данных, в том числе доступа к
            ним, их уничтожения, изменения, блокирования, копирования, предоставления и распространения.
          </li>
          <li>
            Обработка Персональных данных Курьера Компания будет осуществляться исключительно для целей оказания Услуг
            по Оферте, принятия решений или совершения иных действий, относящихся к вопросам сотрудничества с Курьером.
          </li>
          <li>
            Обработка Персональных данных о местонахождении (геолокации) Курьера происходит в фоновом режиме и будет
            осуществляться при использовании онлайн-сервиса Курьером Компания исключительно для целей функционирования
            онлайн-сервиса (оказания Услуг по Оферте) и обеспечения качества функционирования онлайн-сервиса:
            <br />
            (a) чтобы назначать Курьеру ближайшие заказы;
            <br />
            (b) чтобы обеспечить безопасность груза при перевозке заказа Курьером;
            <br />
            (c) чтобы обеспечить безопасность доставки Курьером.
          </li>
          <li>
            Письменное согласие Курьера на Обработку его Персональных данных для целей, указанных в Оферте, считается
            полученным в момент принятия Оферты Курьером.
          </li>
          <li>
            Согласие на Обработку Персональных данных Курьера в соответствии с Офертой действует в течение 10 (десяти)
            лет с даты ее принятия.
          </li>
          <li>
            Курьер вправе в любое время, за исключением случаев, предусмотренных законодательством Республики Казахстан,
            отозвать свое согласие на Обработку Персональных данных Курьера посредством письменного уведомления Компания
            по его юридическому адресу. Компания в течение 30 (тридцати) рабочих дней с момента получения такого отзыва
            обязан прекратить Обработку Персональных данных Курьера и уничтожить их. По запросу Курьера Компания
            предоставит письменное подтверждение об уничтожении Персональных данных Курьера.
          </li>
          <li>
            Компания использует информацию в том числе:
            <br />
            - для регистрации Курьера на Сайте;
            <br />
            - для выполнения своих обязательств перед Курьером (например, назначение ближайших заказов для доставки);
          </li>
          <li>
            Компания вправе использовать технологию «cookies». «Cookies» не содержат конфиденциальную информацию и не
            передаются третьим лицам. Компания получает информацию об ip-адресе посетителя Сайта. Данная информация не
            используется для установления личности Курьера, за исключением случаев мошеннических действий Курьера.
          </li>
          <li>
            Курьер обязан немедленно уведомить Компания о любом случае несанкционированного доступа к личному кабинету
            Курьера и/или о любом нарушении/подозрениях о нарушении конфиденциальности. В целях безопасности, Курьер
            обязан самостоятельно осуществлять безопасное завершение работы по окончании каждой сессии работы в личном
            кабинете.
          </li>
          <li>
            Курьер несет ответственность за достоверность и полноту передаваемых Компания персональных данных и иной
            информации, необходимой для исполнения заказа и Договора.
          </li>
          <li>
            Курьер несет ответственность за несанкционированное получение пароля и доступа к личному кабинету Курьера
            третьими лицами и обеспечивает конфиденциальность данных доступа к личному кабинету. Курьер несет
            ответственность за все действия и последствия использования личного кабинета Курьера, включая случаи
            несанкционированного доступа, а также добровольной передачи Курьером данных для доступа к личному кабинету
            Курьера третьим лицам. При этом все действия в рамках или с использованием личного кабинета Курьера
            считаются произведенными самим Курьером.
          </li>
        </ol>

        <h2>Информационные сообщения:</h2>
        <ol start="16">
          <li>
            Курьер дает свое согласие на получение обновленной информации, информационных сообщений с последними
            новостями, новыми предложениями, специальными предложениями и объявлениями о продаже, а также информации о
            новостях и предложениях партнеров Компания посредством SMS и электронной почты.
          </li>
        </ol>

        <h2>Прочие условия:</h2>
        <ol start="17">
          <li>
            Курьер обязуется соблюдать нормы общественной морали и нравственности, не оскорблять честь и достоинство
            представителей Компания. В случае нарушения вышеуказанного условия после предупреждения Курьера о данном
            нарушении Компания вправе приостановить исполнение настоящего Договора путем аннулирования регистрации в
            онлайн-сервисе.
          </li>
          <li>
            Компания имеет право в любой момент изменять условия Договора в одностороннем порядке без предварительного
            согласования с Курьером, обеспечивая при этом публикацию измененных условий на Сайте. Компания не несет
            ответственности по возможным рискам и условиям безопасного использования, а также за сетевые атаки или взлом
            Сайта (в том числе, но не ограничиваясь), сбои в работе Сайта вызванные техническими причинами.
          </li>
          <li>
            Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по
            Договору на время действия обстоятельств непреодолимой силы. Под обстоятельствами непреодолимой силой
            понимаются чрезвычайные и непреодолимые обстоятельства, препятствующие исполнению своих обязательств
            сторонами по Договору. К ним относятся стихийные явления; воздействие ядерного взрыва, радиации
            (ионизирующего излучения) или радиоактивного заражения материалами ядерного оружия, производственных и
            научно-исследовательских работ или радиоактивными отходами; войны, военные вторжения, враждебные действия
            иностранного врага, военные маневры и связанные с ними мероприятия военного характера; гражданская война,
            вооруженный мятеж, народные волнения всякого рода, массовые беспорядки, насильственный захват или
            насильственное удержание власти; эпидемии, метеоусловия, террористические действия, забастовки, изъятия,
            конфискации, национализация и т.п. При этом общеизвестные события не нуждаются в каком-либо подтверждении.
          </li>
          <li>
            Все споры и разногласия, вытекающие из правоотношений по настоящей Оферте, разрешаются путем переговоров. В
            случае невозможности решения возникших споров в ходе переговоров, такие споры должны быть переданы на
            решение в суд Республики Казахстан, города Алматы с обязательным соблюдением претензионного порядка. Срок
            ответа на претензию составляет 10 (десять) календарных дней.
          </li>
          <li>
            Изображения и тексты, опубликованные на Сайте защищены авторскими правами. Любое использование материалов
            возможно только с письменного разрешения Компания.
          </li>
          <li>Данная версия Договора является текущей и заменяет все предыдущие.</li>
        </ol>

        <br />
        <br />
        <p>
          В случае возникновения вопросов Курьер может обратиться по адресу: г. Алматы, Бостандыкский район, ул.
          Байзакова, 280, бизнес-центр «Almaty Towers», 2 этаж, офис 222, по телефону:
          <a href="tel:77273269902">+7 (727) 326-99-02</a> или посредством электронной почты
          <a href="mailto:ok@raketa.city">ok@raketa.city</a>.
        </p>
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup>
</script>

<style scoped>
h2 {
  @apply mb-1 text-2xl font-bold;
}

ol {
  list-style: auto;
}

a {
  @apply text-blue-500;
}

li {
  @apply ml-5 pl-2;
}
</style>
