<!-- eslint-disable max-lines -->
<template>
  <div class="flex-center pr-28">
    <div class="mx-auto max-w-5xl p-10 text-center">
      <h3 class="pb-5 text-2xl font-bold">ДОГОВОР ПУБЛИЧНОЙ ОФЕРТЫ</h3>

      <div class="relative">
        <ol class="main-ol text-left">
          <li>
            <h4>ОБЩИЕ ПОЛОЖЕНИЯ</h4>
            <ol>
              <li>
                Настоящие Условия оказания услуг («Условия») составляют юридически обязательное соглашение
                («Соглашение») между вами («вы») и Компанией LLP "ZHASKREATIV" (далее - «Компания», «мы», «нас», «наш»)
                регулирующее ваш доступ и использование вебсайта Компании kuryltai.kz, включая любые субдомены
                (совместно, «Сайт»), и все связанные услуги (совместно «Услуги»). Сайт и Услуги в дальнейшем совместно
                именуются как «Платформа».
              </li>
              <li>
                Сбор и использование персональных данных, осуществляемые Компанией в связи с вашим доступом и
                использованием Платформы, описаны в нашей Политике Конфиденциальности, включенной посредством ссылки в
                настоящее Соглашение и находящейся по адресу Политика Конфиденциальности.
              </li>
            </ol>
          </li>

          <li>
            <h4>ОБЪЕМ УСЛУГ</h4>
            <ol>
              <li>
                Платформа предоставляет онлайн-услуги, которые позволяют зарегистрированным пользователям («Авторам»)
                использовать функционал для вступления в юридически обязывающие соглашения с другими пользователями
                («Пользователями») для предоставления доступа к контенту, созданному Авторами и опубликованному в блогах
                или чатах на Платформе («Контент Автора»), на безвозмездной основе или за вознаграждение
                («Вознаграждение Автора»).
              </li>
              <li>
                Пользователи могут делать Донаты и общаться с Авторами любыми способами, доступными на Платформе,
                включая отправку текстовых сообщений. Пользователи и Авторы могут также общаться через личные и
                групповые чаты, доступные определенным пользователям.
              </li>
              <li>
                Компания не владеет, не создает, не продает, не предоставляет и не контролирует Контент Автора и не
                участвует в каких-либо отношениях между Авторами и Пользователями, кроме случаев, указанных в настоящих
                Условиях. Авторы и Пользователи самостоятельно несут ответственность за свой Контент и действия на
                Платформе.
              </li>
              <li>
                Компания может помогать в разрешении споров, но не контролирует и не гарантирует качество, безопасность,
                пригодность или законность Контента Автора или действий Пользователей. Вы должны проявлять должную
                осмотрительность при принятии решений об общении и взаимодействии с другими пользователями Платформы.
              </li>
              <li>
                Используя Платформу, вы действуете от своего имени и за свой счет, а не от имени и не за счет Компании.
                Компания не является агентом, партнером или сотрудником любого Пользователя или Автора.
              </li>
              <li>
                Платформа может содержать ссылки на сторонние веб-сайты или ресурсы. Компания не несет ответственности
                за доступность или точность таких сторонних сервисов или контента, продуктов или услуг, предоставляемых
                этими сервисами.
              </li>
              <li>
                Компания не гарантирует непрерывное и бесперебойное предоставление услуг Платформы. Компания может
                ограничивать доступность Платформы или её функций для выполнения технического обслуживания, улучшения
                работы Платформы или других целей.
              </li>
            </ol>
          </li>

          <li>
            <h4>РЕГИСТРАЦИЯ УЧЕТНОЙ ЗАПИСИ</h4>
            <ol>
              <li>
                Для доступа и использования определенных функций Платформы вам необходимо зарегистрировать учетную
                запись. Вы обязуетесь предоставить правдивую и точную информацию при регистрации и поддерживать
                актуальность данных.
              </li>
              <li>
                Вы несете ответственность за сохранение конфиденциальности своих учетных данных и за все действия,
                совершаемые под вашей учетной записью.
              </li>
              <li>
                В случае утраты или несанкционированного использования учетной записи вы должны незамедлительно сообщить
                об этом Компании.
              </li>
              <li>
                Компания может разрешить регистрацию и вход через учетные записи третьих лиц, таких как социальные сети.
                Информация, связанная с такой учетной записью, может быть использована для предоставления и поддержки
                вашей учетной записи на Платформе.
              </li>
            </ol>
          </li>

          <li>
            <h4>ПРАВА И ОБЯЗАННОСТИ СТОРОН</h4>
            <ol>
              <li>
                Права и обязанности Пользователя
                <ol>
                  <li>
                    Пользователь имеет право на доступ к услугам Платформы в соответствии с условиями настоящего
                    Соглашения.
                  </li>
                  <li>
                    Пользователь обязуется соблюдать все применимые законы Республики Казахстан и нормы морали при
                    использовании Платформы.
                  </li>
                  <li>
                    Пользователь обязуется не использовать Платформу для распространения вредоносного ПО, спама или
                    любой другой незаконной деятельности.
                  </li>
                  <li>
                    Пользователь несет ответственность за достоверность и актуальность предоставленных данных при
                    регистрации на Платформе.
                  </li>
                </ol>
              </li>
              <li>
                Права и обязанности Компании
                <ol>
                  <li>
                    Компания обязуется предоставлять Пользователю услуги Платформы в соответствии с условиями настоящего
                    Соглашения.
                  </li>
                  <li>
                    Компания имеет право изменять условия настоящего Соглашения в любое время с уведомлением
                    Пользователя путем публикации новой версии Соглашения на Платформе.
                  </li>
                  <li>
                    Компания имеет право приостанавливать или прекращать доступ Пользователя к Платформе в случае
                    нарушения условий настоящего Соглашения или действующего законодательства Республики Казахстан.
                  </li>
                </ol>
              </li>
            </ol>
          </li>

          <li>
            <h4>КОНТЕНТ И ПРАВА ИНТЕЛЛЕКТУАЛЬНОЙ СОБСТВЕННОСТИ</h4>
            <ol>
              <li>
                Весь контент, созданный и загруженный Пользователями на Платформу, остается их собственностью. Однако,
                размещая контент на Платформе, Пользователь предоставляет Компании неисключительное право на
                использование, воспроизведение, изменение и распространение данного контента в рамках работы Платформы.
              </li>
              <li>
                Компания не несет ответственности за содержание материалов, размещенных Пользователями на Платформе.
              </li>
              <li>
                Пользователь обязуется не нарушать права интеллектуальной собственности третьих лиц при использовании
                Платформы.
              </li>
            </ol>
          </li>

          <li>
            <h4>ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ</h4>
            <ol>
              <li>
                Компания не несет ответственности за убытки, причиненные в результате использования или невозможности
                использования Платформы.
              </li>
              <li>Компания не несет ответственности за действия и контент Пользователей, размещенных на Платформе.</li>
            </ol>
          </li>

          <li>
            <h4>ИЗМЕНЕНИЯ В УСЛОВИЯХ</h4>
            <ol>
              <li>
                Компания может изменять условия настоящего Соглашения в любое время путем публикации новой версии на
                Платформе. Пользователь обязан периодически проверять условия на предмет изменений. Продолжение
                использования Платформы после публикации изменений означает принятие новых условий.
              </li>
            </ol>
          </li>

          <li>
            <h4>ПРЕКРАЩЕНИЕ ДЕЙСТВИЯ СОГЛАШЕНИЯ</h4>
            <ol>
              <li>Настоящее Соглашение действует до момента его расторжения любой из сторон.</li>
              <li>
                Компания может расторгнуть настоящее Соглашение в любое время с уведомлением Пользователя по электронной
                почте или другим доступным способом.
              </li>
            </ol>
          </li>

          <li>
            <h4>КОНТАКТНАЯ ИНФОРМАЦИЯ</h4>
            <p>
              Если у вас есть вопросы по поводу настоящего Соглашения, пожалуйста, свяжитесь с нами:
              <br />
              Наименование компании: LLP "ZHASKREATIV"
              <br />
              Адрес: Западно-Казахстанская область, Уральск Г.А., Г.Уральск, Микрорайон 4, Дом 2, КВ. 10
              <br />
              Электронная почта: support@kuryltai.kz
            </p>
          </li>
        </ol>
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup></script>

<style scoped>
ol {
  counter-reset: item;
}

.main-ol > li::before {
  @apply absolute left-1 text-xl font-bold;
}

.main-ol > li {
  @apply mt-4;
}

ol > li {
  @apply ml-5 block list-decimal pb-1 pl-1;
}

ol li::before {
  content: counters(item, '.') '. ';
  counter-increment: item;
}

h4 {
  @apply pb-2 text-xl font-bold;
}

a {
  @apply text-blue-500;
}

@media screen and (max-width: 760px) {
  .terms {
    @apply pl-2 pr-2;
  }
}

.text-center {
  text-align: center;
}

.text-left {
  text-align: left;
}
</style>
