<!-- eslint-disable max-lines -->
<template>
  <div class="flex-center pr-28">
    <div class="max-w-5xl p-10">
      <h3 class="pb-5 text-2xl font-bold">ПРАВИЛА ИСПОЛЬЗОВАНИЯ (ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ)</h3>

      <div class="relative">
        <ol class="main-ol">
          <li>
            <h4>ОБЩИЕ ПОЛОЖЕНИЯ</h4>
            <ol>
              <li>
                Частная компания «Raketa Soft Ltd.» (далее – Компания) на условиях, изложенных в настоящем
                Пользовательском соглашении (далее — Соглашение), предоставляет пользователю сети Интернет (далее –
                Курьер) программно-технические возможности Платформы для установления контактов между Курьером и иными
                пользователями, и совершения между ними сделок (предоставление Интернет-площадки, функционирующей в сети
                Интернет в режиме реального времени), с использованием программного обеспечения, позволяющего
                предоставить работоспособность и высокотехнологичность сервисов Платформы, работающих на его основе.
              </li>
              <li>
                Под Платформой в рамках данного Соглашения понимается торговая площадка Компании, имеющая необходимый
                набор сервисов (инфраструктуру), обеспечивающая пользователю и Курьеру возможность устанавливать между
                собой контакты и совершать сделки, представленная в форме веб-сайта и/или иной технологической форме и
                функционирующая в сети Интернет в режиме реального времени с использованием разработанного Компанией
                программного обеспечения, являющейся участником Международного Технологического Парка «Астана Хаб». Все
                существующие на данный момент сервисы Платформы, а также любое их развитие и/или добавление новых
                является предметом настоящего Соглашения.
              </li>
              <li>
                Соглашение может быть изменено Компанией без какого-либо специального уведомления, новая редакция
                Соглашения вступает в силу с момента ее размещения в сети Интернет по указанному в настоящем абзаце
                адресу, если иное не предусмотрено новой редакцией Соглашения. Действующая редакция Соглашения находится
                на странице по адресу https://crm.chocodostavka.kz/terms.
              </li>
              <li>
                Начиная использовать какой-либо сервис/его отдельные функции, либо пройдя процедуру регистрации, Курьер
                считается принявшим условия Соглашения в полном объеме, без всяких оговорок и исключений. В случае
                несогласия Курьера с какими-либо из положений Соглашения Курьер не вправе использовать сервисы Компании.
                В случае если Компаниейбыли внесены какие-либо изменения в Соглашение в порядке, предусмотренном пунктом
                1.3 Соглашения, с которыми Курьер не согласен, он обязан прекратить использование сервисов Компании.
              </li>
            </ol>
          </li>

          <li>
            <h4>УЧЕТНАЯ ЗАПИСЬ КУРЬЕРА</h4>
            <ol>
              <li>
                Использование Платформы возможно при наличии учетной записи, созданной Курьером непосредственно на
                Платформе.
              </li>
              <li>
                Для регистрации Курьер на Платформе обязуется предоставить достоверную и полную информацию о себе в
                объеме, необходимом для регистрации, и поддерживать эту информацию в актуальном состоянии. Если Курьер
                предоставляет неверную информацию или у Компании есть основания полагать, что предоставленная Курьером
                информация неполная или недостоверна, Компания имеет право по своему усмотрению заблокировать учетную
                запись Курьера и отказать Курьеру в использовании своих сервисов (либо их отдельных функций).
              </li>
              <li>
                Персональные данные, предоставленные для создания учетной записи, обрабатывается в соответствии с
                положениями раздела 5 настоящего Соглашения.
              </li>
              <li>
                При использовании Платформы Курьер обеспечивает конфиденциальность и сохранность логина и пароля,
                используемых для входа в учетную запись на Платформе. Компания не несет ответственность за
                несанкционированное использование логина и пароля Курьера третьими лицами.
              </li>
            </ol>
          </li>

          <li>
            <h4>УСЛОВИЯ ИСПОЛЬЗОВАНИЯ ПЛАТФОРМЫ</h4>
            <ol>
              <li>
                Компания предоставляет Курьеру Платформу для обеспечения Курьера возможностью осуществлять услуги
                доставки Отправления посредством использования сервисов Платформы (принятие заказов).
              </li>
              <li>
                Под Отправлением в настоящем Соглашении понимается предназначенный для отправки предмет, соответствующий
                следующим параметрам: не более длина – 1,5 м., не более ширина – 1 м., не более высота – 0,7 м., не
                более вес – до 20 кг.
                <br />
                В Отправлении может быть несколько предметов, каждый из которых должен соответствовать вышеуказанным
                параметрам.
              </li>
              <li>
                Помимо негабаритных предметов Курьер не принимает к доставке следующие предметы:
                <br />
                <ul class="non-iter">
                  <li>
                    боевое ручное стрелковое, гражданское и служебное оружие, боеприпасы, запасные части и комплектующие
                    для них, луки и арбалеты спортивные, оружие предназначенное для подачи световых, дымовых и звуковых
                    сигналов, электрическое оружие, электрошоковые устройства и искровые разрядники, холодное клинковое
                    оружие, кистени, кастеты, сюрикены, бумеранги и другие приспособленные предметы ударно-дробящего,
                    метательного, колюще-режущего действия за исключением спортивных снарядов, специальные технические
                    средства двойного применения и комплектующие для них;
                  </li>
                  <li>наркотические средства, психотропные вещества, прекурсоры и их аналоги;</li>
                  <li>
                    ядерные материалы, радиоактивные, сильнодействующие, едкие, взрывчатые и легковоспламеняющиеся
                    вещества, средства взрывания, пиротехнические вещества и изделия с их применением, и другие опасные
                    вещества;
                  </li>
                  <li>яды, ядовитые животные, ядовитые вещества, ядовитые растения и семена ядовитых растений;</li>
                  <li>национальную валюту Республики Казахстан и иностранную валюту;</li>
                  <li>
                    печатные издания, изобразительные материалы, кино-, фото-, аудио-, и видеоматериалы, содержащие
                    пропаганду или агитацию насильственного изменения конституционного строя, нарушения целостности
                    Республики Казахстан, подрыва безопасности государства, войны, социального, расового, национального,
                    религиозного, сословного и родового превосходства, культа жестокости, насилия и порнографии;
                  </li>
                  <li>скоропортящиеся продукты питания без специальной упаковки;</li>
                  <li>
                    предметы и вещества, которые по своему характеру или из-за упаковки могут представлять опасность для
                    людей, загрязнять или портить (повреждать) другие грузы, окружающих людей или предметы;
                  </li>
                  <li>животных и растений, биологические материалы;</li>
                  <li>
                    предметы, требующие для перевозки специально оборудованные транспортные средства, включая пищевые
                    продукты;
                  </li>
                  <li>жидкости в открытой таре;</li>
                  <li>предметы, не соответствующие габаритам, предусмотренным настоящим Соглашением;</li>
                  <li>хрупкие предметы без специальной упаковки;</li>
                  <li>
                    любые иные предметы, оборот которых запрещен или ограничен на территории Республики Казахстан.
                  </li>
                </ul>
                <br />
                Курьер вправе предусмотреть иные требования к Отправлению, не противоречащие законодательству Республики
                Казахстан.
              </li>
              <li>
                Курьер обязуется соблюдать правила Платформы, а также условия соглашений, заключенных между Курьером и
                пользователями или Партнерами Компании. В случае нарушения правил Платформы или указанных соглашений
                Компания вправе содействовать пользователям или Партнерам Компании во взыскании с Курьера штрафа
                согласно условиям, размещенным на Платформе.
              </li>
            </ol>
          </li>

          <li>
            <h4>ОСУЩЕСТВЛЕНИЕ РАСЧЕТОВ С КУРЬЕРАМИ</h4>
            <ol>
              <li>Компания не предоставляет сервис для осуществления платежей за услуги Курьера.</li>
              <li>
                Компания не осуществляет хранение реквизитов платежных карт и обработку платежей за услуги Курьера.
              </li>
              <li>
                Курьер самостоятельно или через представителя Курьера осуществляет выдачу чека контрольно-кассовой
                машины или товарный чек на сумму, уплаченную за услугу Курьера.
              </li>
            </ol>
          </li>

          <li>
            <h4>ПРАВИЛА ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ</h4>
            <ol>
              <li>
                Принимая настоящее Соглашение, Курьер дает согласие на совершение Компанией всех действий в отношении
                его Персональных данных.
              </li>
              <li>
                Под Персональными данными понимаются сведения, относящиеся к определенному или определяемому на их
                основании субъекту персональных данных, т.е. к Курьеру.
                <br />
                Персональные данные, предоставленные Курьером или третьими лицами, с которыми Курьер заключил
                соглашение:
                <br />
                <ul class="non-iter">
                  <li>имя, фамилия, отчество (при наличии), номер телефона, изображение, возраст;</li>
                  <li>электронные данные (IP-адрес, файлы cookie);</li>
                  <li>дата и время осуществления доступа к Платформе;</li>
                  <li>информация о геолокации;</li>
                  <li>
                    данные платежных карт, иная платежная информация, предоставленная Курьером, а также полученная от
                    иных лиц, участвующих в проведении платежной операции.
                  </li>
                  <li>Фотография</li>
                  <li>ИИН и иные данные документа, удостоверяющего личность</li>
                </ul>
              </li>
              <li>
                Цель обработки Персональных данных – идентификация Курьера, предоставление доступа к Платформе,
                выполнение обязательств по Соглашению, реализация функционала Платформы, обеспечение исполнения
                обязательств по соглашению с третьими лицами, аналитика, обеспечение безопасности и установление фактов
                мошенничества.
              </li>
              <li>
                Способы обработки Персональных данных – сбор, запись, систематизация, накопление, хранение, уточнение
                (обновление, изменение), извлечение, использование, передача (предоставление, доступ), блокирование,
                удаление, уничтожение.
              </li>
              <li>
                Обработка информации о геолокации происходит в фоновом режиме и будет осуществляться только при
                использовании Платформы исключительно для целей функционирования Платформы и обеспечения качества
                функционирования Платформы:
                <br />
                <ul class="non-iter">
                  <li>для назначения Курьеру ближайших заказов;</li>
                  <li>для обеспечения безопасности Отправления при передаче Курьеру;</li>
                  <li>для обеспечения безопасности доставки Отправления Курьером.</li>
                </ul>
              </li>
              <li>
                Передача Персональных данных возможна только в случаях, установленных законодательством Республики
                Казахстан, и осуществляется на основании законодательства Республики Казахстан или договоров между
                Компаниейи третьими лицами в целях, определенных настоящим Соглашением:
                <br />
                <ul class="non-iter">
                  <li>
                    регулирующим органам, правоохранительным органам, центральным или местным исполнительным органам
                    власти, другим государственным органам или суду, которым Компания обязана предоставлять Персональные
                    данные в соответствии с законодательством Республики Казахстан по соответствующему запросу;
                  </li>
                  <li>
                    третьим лицам, в случае если Курьер выразил им согласие на передачу Персональных данных, либо
                    передача Персональных данных требуется для выполнения определенного соглашения или договора,
                    заключенного с Курьером;
                  </li>
                  <li>
                    третьим лицам, которым передаются Персональные данные в целях обеспечения правовой защиты Компании
                    или третьих лиц при нарушении Пользователем Соглашения или иного договора, заключенного с Курьером,
                    либо в ситуации, когда существует угроза такого нарушения.
                  </li>
                  <li>третьим лицам, предоставляющим Компании услуги аналитики по соответствующему соглашению.</li>
                  <li>третьим лицам, предоставляющим Компании услуги платежей</li>
                </ul>
              </li>
              <li>
                Персональные данные обрабатываются Компанией на основаниях, предусмотренных законодательством Республики
                Казахстан, в случаях:
                <br />
                <ul class="non-iter">
                  <li>выполнения обязательств по договору или соглашению между Компанией и Курьером;</li>
                  <li>соблюдения законодательства Республики Казахстан;</li>
                  <li>
                    для обеспечения законных интересов Компании в соответствии с законодательством Республики Казахстан.
                  </li>
                </ul>
              </li>
              <li>
                Компания всегда обрабатывает необходимые Персональные данные в определенных целях. В частности, к таким
                целям относятся:
                <br />
                <ul class="non-iter">
                  <li>предоставление Курьеру доступа к Платформе и к учетной записи;</li>
                  <li>
                    осуществление связи с Курьером для направления уведомлений, запросов и информации, относящейся к
                    работе Платформы, выполнения соглашений с Курьером;
                  </li>
                  <li>модификация и модернизация Платформы;</li>
                  <li>защита прав Курьера и прав Компании;</li>
                  <li>сбор, обработка и представление статистических данных, больших данных и других исследований;</li>
                  <li>
                    выявление угроз безопасности для Платформы, пользователей, Компании и/или третьих лиц, в том числе
                    проверка благонадежности Курьера при заключении договоров с использованием Платформы;
                  </li>
                  <li>организация приема платежей с использованием Платформы.</li>
                </ul>
              </li>
              <li>
                Все разговоры Курьера со специалистами службы поддержки могут быть записаны в целях контроля качества и
                совершенствования обслуживания.
              </li>
              <li>Курьер несет ответственность за обработку данных других участников Платформы</li>
              <li>
                Срок хранения Персональных данных определяется датой достижения целей их сбора и обработки или отзывом
                Курьера согласия на обработку Персональных данных.
              </li>
              <li>
                Курьер несет обязанности и обладает иными правами, предусмотренных законодательством Республики
                Казахстан.
              </li>
              <li>
                В случае прекращения взаимодействия Курьера и Компании с удалением учетной записи, в отношении
                Персональных данных, использованных в качестве идентификаторов, в том числе обеспечивающих доступ на
                Платформу, Компания вправе осуществлять статичное (архивное) хранение в целях
                предупреждения/предотвращения недобросовестных/мошеннических действий с использованием впоследствии
                таких данных на Платформе, а также в целях обеспечения информационно-технической безопасности.
              </li>
            </ol>
          </li>

          <li>
            <h4>ПАРТНЕРЫ КОМПАНИИ</h4>
            <ol>
              <li>
                Партнерами Компании являются лица, входящие в группу компаний Choco, а также иные лица, имеющие
                соответствующие договоры/соглашения с Компанией.
              </li>
              <li>
                Компания и Партнеры Компании вправе осуществлять свою деятельность как самостоятельно, так и в рамках
                экосистемы.
              </li>
              <li>
                Партнеры Компании вправе заключать договоры с Курьером или представителем Курьера, содержащие условия
                вознаграждения Курьера, порядка исполнения заказов и иные условия.
              </li>
            </ol>
          </li>

          <li>
            <h4>ИНЫЕ УСЛОВИЯ</h4>
            <ol>
              <li>
                Ничто в Соглашении не может пониматься как установление между Курьером и Компанииейагентских отношений,
                отношений товарищества, отношений по совместной деятельности, отношений личного найма, либо каких-то
                иных отношений, прямо не предусмотренных Соглашением.
              </li>
              <li>
                Если по тем или иным причинам одно или несколько положений настоящего Соглашения будут признаны
                недействительными или не имеющими юридической силы, это не оказывает влияния на действительность или
                применимость остальных положений Соглашения.
              </li>
              <li>
                Курьер обязуется соблюдать законодательство Республики Казахстан, правила Компании, положения настоящего
                Соглашения, а также нормы общественной морали и нравственности, не оскорблять честь и достоинство
                представителей Компании, пользователей и иных лиц на Платформе.
              </li>
              <li>
                В случае нарушения вышеуказанного условия после предупреждения Курьера о данном нарушении Компания
                вправе приостановить исполнение настоящего Соглашения путем деактивации учетной записи Курьера. Компания
                вправе осуществлять модерацию сообщений и иной информации, размещаемой Курьером в соответствующих
                разделах Платформы в отношении Платформы, услуг и участников Платформы, содержащих оценку, отзывы и т.п.
              </li>
              <li>
                Принимая заказ, Курьер признает, что такой заказ может включать услугу возврата или выполнение
                инструкций, которые должны быть исполнены Курьером.
              </li>
              <li>
                Курьер признает, что он как поставщик услуг несет полную ответственность за результат предоставляемых им
                услуг. В связи с этим могут возникнуть дополнительные расходы, связанные с отменой, неправильным
                предоставлением услуг, невозможностью продолжения или прекращения выполнения заказа, компенсацией другим
                пользователям за риски в связи с действиями Курьера и т.д., которые Курьер во всех случаях несет
                самостоятельно.
              </li>
              <li>
                При осуществлении услуг подакцизных товаров таких как алкоголь, табачные изделия, Курьер должен
                удостовериться, что получатель достиг установленный законодательством Республики Казахстан возраста.
                Если получатель не достиг установленный законодательством Республики Казахстан возраста или не
                подтвердит его соответствующими документами, Курьер обязан не передавать заказ и вернуть его отправителю
                или действовать согласно инструкциям, полученным на Платформе или от Партнера Компании.
              </li>
              <li>Соглашение и его исполнение регулируется в соответствии с законодательством Республики Казахстан.</li>
              <li>
                Курьер использует Платформу по принципу «как есть». Компания не гарантирует, что сервисы
                соответствуют/будут соответствовать требованиям Курьера; сервисы будут предоставляться непрерывно,
                быстро, надежно и без ошибок; результаты, которые могут быть получены с использованием сервисов, будут
                точными и надежными и могут использоваться для каких-либо целей или в каком-либо качестве (например, для
                установления и/или подтверждения каких-либо фактов); качество какого-либо продукта, услуги, информации и
                пр., полученных с использованием сервисов, будет соответствовать ожиданиям Курьера.
              </li>
              <li>
                Компания не несет ответственности за любые виды убытков, произошедшие вследствие использования Курьером
                Платформы и/или отдельных частей/функций сервисов Платформы.
              </li>
            </ol>
          </li>

          <li>
            <h4>РЕКВИЗИТЫ КОМПАНИИ</h4>
            <p>
              Частная компания «Raketa Soft Ltd.»
              <br />
              БИН: 210840900237
              <br />
              Юридический адрес: Республика Казахстан, город Астана, район Есиль, улица Алихан Бокейхана 42/1, офис 4,
              Z05T5M0
              <br />
              Фактический адрес: Республика Казахстан, город Алматы, Бостандыкский район, ул. Байзакова, 280
              <br />
              Телефон: <a href="tel:+77273269902">+7 (727) 326-99-02</a>
              <br />
              Электронная почта: <a href="mailto:ok@raketa.city">ok@raketa.city</a>
            </p>
          </li>
        </ol>
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup>
</script>

<style scoped>
ol {
  counter-reset: item;
}

.main-ol > li::before {
  @apply absolute left-1 text-xl font-bold;
}

.main-ol > li {
  @apply mt-4;
}

ol > li {
  @apply ml-5 block list-decimal pb-1 pl-1;
}

ol li::before {
  content: counters(item, '.') '. ';
  counter-increment: item;
}

.non-iter > li {
  @apply ml-4 list-disc pl-2;
}

.non-iter > li::before {
  @apply content-none;
}

h4 {
  @apply pb-2 text-xl font-bold;
}

a {
  @apply text-blue-500;
}

@media screen and (max-width: 760px) {
  .terms {
    @apply pl-2 pr-2;
  }
}
</style>
